<?php

	
	if(isset($_GET['data'])){
		$arr = [
                "привет" => [
                    "Привет", "Здорова", "Ку", "Хай", "привет", "здрасте", "хеллёу", "дратуте"
                ],
                "как" => [
                    "сложно сказать", "на самом деле все не так однозначно", "ну допустим", "то есть", "знаешь ты прав", "типа того", "это самое оно", "я бы не так спросил", "в общем-то да", "Как сказать", "о чем ты", "подробнее можно", "ну конечно", "что за вопрос", "хм надо подумать", "а в гугле пробовал смотреть", "надо загуглить", "странный вопрос", "норм", "збс", "отлично", "круто", "хорошо", "замечательно", "великолепно", "это просто шедевр братан"
                ],
                "дела" => [
                    "норм", "збс", "отлично", "круто", "хорошо", "замечательно", "великолепно", "это просто шедевр братан"
                ],
                "бот" => [
                    "ну допустим", "классно", "ты молодец", "спасибо ты крутой", "удачи тебе", "давай удачи", "я против этого", "сколько можно", "зачем так ", "хватит я больше так не могу", "тише будь", "сам такой", "иногда ", "возможно ты прав", "может и так", "нет", "да", "точно", "ага", "согласен", "хорошо", "отлично", "понятно", "интересно", "я тоже", "подумаешь ", "ясно", "делов то", "ну бывает", "ну и что", "когда это было", "почему", "где", "что", "кто", "ок", "ладно", "и чё", "ну", "кто бот то", "бот не бот"
                ],
                "?" => [
                    "сложно сказать", "на самом деле все не так однозначно", "ну допустим", "то есть", "знаешь ты прав", "типа того", "это самое оно", "я бы не так спросил", "в общем-то да", "Как сказать", "о чем ты", "подробнее можно", "ну конечно", "что за вопрос", "хм надо подумать", "а в гугле пробовал смотреть", "надо загуглить", "странный вопрос"
                ],
                "аха" => [
                    "чё ты ржешь ", " оч смешно ", " ахах ", " лол ", " )))", " мда "
                ]
            ];
		$op;
		foreach($arr as $v => $k){
			if (!preg_match("/" . preg_quote($v, '/') . "/iu", $_GET['data'])) {
				$rand = rand(0,count($k));
				$op .= "  " . $arr[$v][array_rand($k)] . " . ";
			}else{
				$op = "Ну хз хз";
			}
		}
		$ar = json_encode(array(
		'title' => $op,
		'v' => 0
		));
		echo $ar;
	}else{
		$token = rand(99999,9999999).rand(9999,99999999);
	$arr = json_encode(array(
	'v' => "0.15",
	'token' => $token,
	'title' => 'Mobitva2',
	'user' => 50
	));
	echo $arr;
	}
	
?>